yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostm8al3168.h
#define TIM3_CCR2L_CCR10         TIM3_CCR2L_bit.CCR10
#define TIM3_CCR2L_CCR11         TIM3_CCR2L_bit.CCR11
#define TIM3_CCR2L_CCR12         TIM3_CCR2L_bit.CCR12
#define TIM3_CCR2L_CCR13         TIM3_CCR2L_bit.CCR13
#define TIM3_CCR2L_CCR14         TIM3_CCR2L_bit.CCR14
#define TIM3_CCR2L_CCR15         TIM3_CCR2L_bit.CCR15
#define TIM3_CCR2L_CCR16         TIM3_CCR2L_bit.CCR16
#define TIM3_CCR2L_CCR17         TIM3_CCR2L_bit.CCR17

#define TIM3_BKR_LOCK            TIM3_BKR_bit.LOCK
#define TIM3_BKR_OSSI            TIM3_BKR_bit.OSSI
#define TIM3_BKR_BKE             TIM3_BKR_bit.BKE
#define TIM3_BKR_BKP             TIM3_BKR_bit.BKP
#define TIM3_BKR_AOE             TIM3_BKR_bit.AOE
#define TIM3_BKR_MOE             TIM3_BKR_bit.MOE

#define TIM3_OISR_OIS1           TIM3_OISR_bit.OIS1
#define TIM3_OISR_OIS2           TIM3_OISR_bit.OIS2

#endif

/*-------------------------------------------------------------------------
 *      TIM3 bit masks
 *-----------------------------------------------------------------------*/
#define MASK_TIM3_CR1_CEN        0x01
#define MASK_TIM3_CR1_UDIS       0x02
#define MASK_TIM3_CR1_URS        0x04
#define MASK_TIM3_CR1_OPM        0x08
#define MASK_TIM3_CR1_DIR        0x10
#define MASK_TIM3_CR1_CMS        0x60
#define MASK_TIM3_CR1_ARPE       0x80

#define MASK_TIM3_CR2_CCDS       0x08
#define MASK_TIM3_CR2_MMS        0x70
#define MASK_TIM3_CR2_TI1S       0x80

#define MASK_TIM3_SMCR_SMS       0x07
#define MASK_TIM3_SMCR_TS        0x70
#define MASK_TIM3_SMCR_MSM       0x80

#define MASK_TIM3_ETR_ETF        0x0F
#define MASK_TIM3_ETR_ETPS       0x30
#define MASK_TIM3_ETR_ECE        0x40
#define MASK_TIM3_ETR_ETP        0x80

#define MASK_TIM3_DER_UDE        0x01
#define MASK_TIM3_DER_CC1DE      0x02
#define MASK_TIM3_DER_CC2DE      0x04

#define MASK_TIM3_IER_UIE        0x01
#define MASK_TIM3_IER_CC1IE      0x02
#define MASK_TIM3_IER_CC2IE      0x04
#define MASK_TIM3_IER_TIE        0x40
#define MASK_TIM3_IER_BIE        0x80

#define MASK_TIM3_SR1_UIF        0x01
#define MASK_TIM3_SR1_CC1IF      0x02
#define MASK_TIM3_SR1_CC2IF      0x04
#define MASK_TIM3_SR1_TIF        0x40
#define MASK_TIM3_SR1_BIF        0x80

#define MASK_TIM3_SR2_CC1OF      0x02
#define MASK_TIM3_SR2_CC2OF      0x04

#define MASK_TIM3_EGR_UG         0x01
#define MASK_TIM3_EGR_CC1G       0x02
#define MASK_TIM3_EGR_CC2G       0x04
#define MASK_TIM3_EGR_TG         0x40
#define MASK_TIM3_EGR_BG         0x80

#define MASK_TIM3_CCMR1_CC1S     0x03
#define MASK_TIM3_CCMR1_OC1FE    0x04
#define MASK_TIM3_CCMR1_OC1PE    0x08
#define MASK_TIM3_CCMR1_OC1M     0x70

#define MASK_TIM3_CCMR2_CC2S     0x03
#define MASK_TIM3_CCMR2_OC2FE    0x04
#define MASK_TIM3_CCMR2_OC2PE    0x08
#define MASK_TIM3_CCMR2_OC2M     0x70

#define MASK_TIM3_CCER1_CC1E     0x01
#define MASK_TIM3_CCER1_CC1P     0x02
#define MASK_TIM3_CCER1_CC2E     0x10
#define MASK_TIM3_CCER1_CC2P     0x20

#define MASK_TIM3_CNTRH_CNT8     0x01
#define MASK_TIM3_CNTRH_CNT9     0x02
#define MASK_TIM3_CNTRH_CNT10    0x04
#define MASK_TIM3_CNTRH_CNT11    0x08
#define MASK_TIM3_CNTRH_CNT12    0x10
#define MASK_TIM3_CNTRH_CNT13    0x20
#define MASK_TIM3_CNTRH_CNT14    0x40
#define MASK_TIM3_CNTRH_CNT15    0x80

#define MASK_TIM3_CNTRL_CNT0     0x01
#define MASK_TIM3_CNTRL_CNT1     0x02
#define MASK_TIM3_CNTRL_CNT2     0x04
#define MASK_TIM3_CNTRL_CNT3     0x08
#define MASK_TIM3_CNTRL_CNT4     0x10
#define MASK_TIM3_CNTRL_CNT5     0x20
#define MASK_TIM3_CNTRL_CNT6     0x40
#define MASK_TIM3_CNTRL_CNT7     0x80

#define MASK_TIM3_PSCR_PSC       0x07

#define MASK_TIM3_ARRH_ARR8      0x01
#define MASK_TIM3_ARRH_ARR9      0x02
#define MASK_TIM3_ARRH_ARR10     0x04
#define MASK_TIM3_ARRH_ARR11     0x08
#define MASK_TIM3_ARRH_ARR12     0x10
#define MASK_TIM3_ARRH_ARR13     0x20
#define MASK_TIM3_ARRH_ARR14     0x40
#define MASK_TIM3_ARRH_ARR15     0x80

#define MASK_TIM3_ARRL_ARR0      0x01
#define MASK_TIM3_ARRL_ARR1      0x02
#define MASK_TIM3_ARRL_ARR2      0x04
#define MASK_TIM3_ARRL_ARR3      0x08
#define MASK_TIM3_ARRL_ARR4      0x10
#define MASK_TIM3_ARRL_ARR5      0x20
#define MASK_TIM3_ARRL_ARR6      0x40
#define MASK_TIM3_ARRL_ARR7      0x80

#define MASK_TIM3_CCR1H_CCR18    0x01
#define MASK_TIM3_CCR1H_CCR19    0x02
#define MASK_TIM3_CCR1H_CCR110   0x04
#define MASK_TIM3_CCR1H_CCR111   0x08
#define MASK_TIM3_CCR1H_CCR112   0x10
#define MASK_TIM3_CCR1H_CCR113   0x20
#define MASK_TIM3_CCR1H_CCR114   0x40
#define MASK_TIM3_CCR1H_CCR115   0x80

#define MASK_TIM3_CCR1L_CCR10    0x01
#define MASK_TIM3_CCR1L_CCR11    0x02
#define MASK_TIM3_CCR1L_CCR12    0x04
#define MASK_TIM3_CCR1L_CCR13    0x08
#define MASK_TIM3_CCR1L_CCR14    0x10
#define MASK_TIM3_CCR1L_CCR15    0x20
#define MASK_TIM3_CCR1L_CCR16    0x40
#define MASK_TIM3_CCR1L_CCR17    0x80

#define MASK_TIM3_CCR2H_CCR28    0x01
#define MASK_TIM3_CCR2H_CCR29    0x02
#define MASK_TIM3_CCR2H_CCR210   0x04
#define MASK_TIM3_CCR2H_CCR211   0x08
#define MASK_TIM3_CCR2H_CCR212   0x10
#define MASK_TIM3_CCR2H_CCR213   0x20
#define MASK_TIM3_CCR2H_CCR214   0x40
#define MASK_TIM3_CCR2H_CCR215   0x80

#define MASK_TIM3_CCR2L_CCR10    0x01
#define MASK_TIM3_CCR2L_CCR11    0x02
#define MASK_TIM3_CCR2L_CCR12    0x04
#define MASK_TIM3_CCR2L_CCR13    0x08
#define MASK_TIM3_CCR2L_CCR14    0x10
#define MASK_TIM3_CCR2L_CCR15    0x20
#define MASK_TIM3_CCR2L_CCR16    0x40
#define MASK_TIM3_CCR2L_CCR17    0x80

#define MASK_TIM3_BKR_LOCK       0x03
#define MASK_TIM3_BKR_OSSI       0x04
#define MASK_TIM3_BKR_BKE        0x10
#define MASK_TIM3_BKR_BKP        0x20
#define MASK_TIM3_BKR_AOE        0x40
#define MASK_TIM3_BKR_MOE        0x80

#define MASK_TIM3_OISR_OIS1      0x01
#define MASK_TIM3_OISR_OIS2      0x04


/*-------------------------------------------------------------------------
 *      TIM1 register definitions
 *-----------------------------------------------------------------------*/
/* TIM1 control register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CEN         : 1;
  unsigned char UDIS        : 1;
  unsigned char URS         : 1;
  unsigned char OPM         : 1;
  unsigned char DIR         : 1;
  unsigned char CMS         : 2;
  unsigned char ARPE        : 1;
} __BITS_TIM1_CR1;
#endif
__IO_REG8_BIT(TIM1_CR1,    0x52B0, __READ_WRITE, __BITS_TIM1_CR1);

